* Correlation of r0 with D
- If we *assume* that the relation is linear, then we can get a better estimate of the average ratio and its spread, which should be tighter than the mcmc results
- From the following table I get an unweighted average of 0.02 +/- 0.01
  - There is not much variation in weights, so a weighted average would not be much different
- This can be compared with the result from  the mcmc analysis
  - log r0 = (0.95±0.33)log DHII +(-1.67±0.73)
  - Implying a ratio of 10**(-1.67 +/- 0.73) = 0.02138 +/- 0.03594
    - So the value is the same, but the linear translation of the error is larger than the value!
    - Better to do 10**(-1.67 + [-0.73, 0, 0.73]) = [0.004, 0.021, 0.115]
    - So the credibility interval is from 0.004 to 0.12

| Name     |   D |  eD |    r0 |   er0 |  r0/D | erat |
|----------+-----+-----+-------+-------+-------+------|
| Orion    |   5 | 0.5 | 0.068 | 0.006 | 0.014 | 0.13 |
| Lagoon   |  25 | 2.5 |   1.0 |   0.2 | 0.040 | 0.22 |
| Carina   | 200 |  20 |   0.5 |   0.1 | 0.003 | 0.22 |
| 30 Dor   | 370 |  37 |   4.0 |   1.0 | 0.011 | 0.27 |
| NGC 346  | 220 |  22 |   2.4 |   0.3 | 0.011 | 0.16 |
| Hubble X | 160 |  16 |   4.0 |   0.5 | 0.025 | 0.16 |
| Hubble V | 130 |  13 |   3.6 |   0.8 | 0.028 | 0.24 |
| NGC 595  | 400 |  40 |    11 |   1.0 | 0.028 | 0.14 |
| NGC 604  | 400 |  40 |    12 |   4.0 | 0.030 | 0.35 |
|----------+-----+-----+-------+-------+-------+------|
|          |     |     |       |       | 0.021 | mean |
|          |     |     |       |       | 0.012 | sdev |
#+TBLFM: $6=$4/$2;f3::$7=hypot($3/$2, $5/$4);f2::@11$6=vmean(@I..@II);f3::@11$7=mean::@12$6=vsdev(@I..@II);f3::@12$7=sdev


* Other definitions of correlation length
- Jaupart:2022i have a more rigorous treatment of all this
  - Statistical properties and correlation length in star-forming molecular clouds - I. Formalism and application to observations
  - E. Jaupart and G. Chabrier
  - A&A, 663 (2022) A113
  - DOI: https://doi.org/10.1051/0004-6361/202141084
- They cite Papoulis & Pillai (1965) book
  - I managed to get the PDF from academia.edu
  - [[https://www.dropbox.com/sh/adhs0wprrhl9m3n/AAD55KvG73CLol5ug7qV3MIPa?dl=0][Dropbox link]]
  - But I cannot find any discussion of correlation length in multiple dimensions in that book. They mainly talk about one-dimensional cases in the time domain
- Jaupart equation (11) is for general D-dimensional case. Specialising to 2 dimensions and assuming C(0) = 1 gives
  \[
  \ell_C^2 = \frac{1}{4} \int C(r) \, d^2 r = \frac{\pi}{2} \int_0^\infty r C(r) d r
  \]
- Then using our model covariance: \(C(r) = 2^{-(r/r_0)^m}\)
- And assuming m = 1 for simplicity
- We can write r = r_0 x so the integral above is
  - r_0^2 \int_0^\infty x 2^{-x} dx = r_0^2 / ln^2(2)
- Therefore \ell_c / r_0 = \sqrt{\pi/2} / \ln{2} = 1.808
- The general case can be done with a change of variable
  - See my Apple Note [[file:Correlation length.pdf]]
  - 


- Integrate exp(-x^m) dx
  - x put u = x^m or x = u^{1/m}
  - du = m x^(m - 1) dx
  - dx = (1/m) = u^{1/m - 1}



